; domain
(define (domain LiquidSort)
    (:requirements :adl :typing)
    (:types
        beaker color level - object
    )

    (:predicates
        ; --- STATICI (Geometria) ---
        ; Definisce la sequenza dei livelli: (succ l0 l1), (succ l1 l2)...
        ; l0 è un livello fittizio che rappresenta il fondo/vuoto.
        (succ ?l1 ?l2 - level)

        ; Identifica il livello "zero" (il fondo sotto il primo slot)
        (is-bottom ?l - level)

        ; --- DINAMICI (Stato del gioco) ---
        ; Inserisce il colore C nel beaker B al livello L
        (has-color ?b - beaker ?l - level ?c - color)

        ; Definisce il livello più alto occupato nel beaker.
        ; Se il beaker è vuoto, il top è l0.
        (top ?b - beaker ?l - level)
    )

    (:action pour-chunk-1
        :parameters (
            ?from - beaker     ; Da dove prendo
            ?to - beaker       ; Dove verso
            ?c - color         ; Il colore che sposto

            ; Variabili per i livelli ORIGINE
            ?l-src-top - level ; Il livello attuale pieno in FROM (es. l3)
            ?l-src-below - level ; Il livello sotto (es. l2)

            ; Variabili per i livelli DESTINAZIONE
            ?l-dest-top - level ; Il livello attuale pieno in TO (es. l0 se vuota)
            ?l-dest-new - level ; Il livello che riempiremo (es. l1)
        )
        :precondition (and
            ; 1. Non posso versare nello stesso beaker
            (not (= ?from ?to))

            ; 2. Gestione PUNTATORI (Top e Succ)
            (top ?from ?l-src-top)        ; Il from è pieno fino a src-top
            (succ ?l-src-below ?l-src-top); src-below sta subito sotto src-top
            (top ?to ?l-dest-top)         ; Il to è pieno fino a dest-top
            (succ ?l-dest-top ?l-dest-new); dest-new è il prossimo spazio libero

            ; 3. CONTROLLO COLORE SORGENTE (Deve esserci il colore C)
            (has-color ?from ?l-src-top ?c)

            ; 4. VINCOLO CHUNK
            ; Questa azione è valida SOLO SE sotto non c'è lo stesso colore.
            ; Altrimenti dovrei usare pour-chunk-2.
            (or
                (is-bottom ?l-src-below)  ; O sono arrivato al fondo
                (not (has-color ?from ?l-src-below ?c)) ; O il colore sotto è diverso
            )

            ; 5. VINCOLO DESTINAZIONE
            ; La destinazione deve essere vuota (top è bottom)
            ; OPPURE avere lo stesso colore in cima.
            (or
                (is-bottom ?l-dest-top)
                (has-color ?to ?l-dest-top ?c)
            )
        )
        :effect (and
            ; Aggiorna puntatori top
            (not (top ?from ?l-src-top))
            (top ?from ?l-src-below)

            (not (top ?to ?l-dest-top))
            (top ?to ?l-dest-new)

            ; Sposta il liquido
            (not (has-color ?from ?l-src-top ?c))
            (has-color ?to ?l-dest-new ?c)
        )
    )

    (:action pour-chunk-2
        :parameters (
            ?from - beaker ?to - beaker ?c - color

            ; Livelli Origine (Dall'alto verso il basso)
            ?l-src-1 - level  ; Top attuale
            ?l-src-2 - level  ; Sotto top
            ?l-src-3 - level  ; Sotto ancora (il punto di stacco)

            ; Livelli Destinazione (Dal basso verso l'alto)
            ?l-dest-0 - level ; Top attuale
            ?l-dest-1 - level ; Primo spazio libero
            ?l-dest-2 - level ; Secondo spazio libero
        )
        :precondition (and
            (not (= ?from ?to))

            ; --- Struttura Origine ---
            (top ?from ?l-src-1)
            (succ ?l-src-2 ?l-src-1)
            (succ ?l-src-3 ?l-src-2)

            ; Devono esserci 2 unità dello stesso colore
            (has-color ?from ?l-src-1 ?c)
            (has-color ?from ?l-src-2 ?c)

            ; VINCOLO CHUNK: Sotto le 2 unità deve finire il blocco
            (or
                (is-bottom ?l-src-3)
                (not (has-color ?from ?l-src-3 ?c))
            )

            ; --- Struttura Destinazione ---
            (top ?to ?l-dest-0)
            (succ ?l-dest-0 ?l-dest-1)
            (succ ?l-dest-1 ?l-dest-2) ; Deve esserci spazio per 2!

            ; Compatibilità colore destinazione
            (or
                (is-bottom ?l-dest-0)
                (has-color ?to ?l-dest-0 ?c)
            )
        )
        :effect (and
            ; Aggiorna puntatori top
            (not (top ?from ?l-src-1))
            (top ?from ?l-src-3)          ; Il nuovo top scende di 2

            (not (top ?to ?l-dest-0))
            (top ?to ?l-dest-2)           ; Il nuovo top sale di 2

            ; Sposta i liquidi
            (not (has-color ?from ?l-src-1 ?c))
            (not (has-color ?from ?l-src-2 ?c))
            (has-color ?to ?l-dest-1 ?c)
            (has-color ?to ?l-dest-2 ?c)
        )
    )

    (:action pour-chunk-3
        :parameters (
            ?from - beaker ?to - beaker ?c - color

            ; from beaker levels from top to bottom
            ?l-src-1 - level ; this is the top of color c
            ?l-src-2 - level
            ?l-src-3 - level
            ?l-src-4 - level ; this will be a different color and new top

            ; to beaker from top to new top
            ?l-dest-0 - level ; this is the top and is color c
            ?l-dest-1 - level
            ?l-dest-2 - level
            ?l-dest-3 - level ; this will be the new top
        )
        :precondition (and
            (not (= ?from ?to))
            ; FROM BEAKER STRUCTURE
            ; correct sequence of levels
            (top ?from ?l-src-1)
            (succ ?l-src-2 ?l-src-1)
            (succ ?l-src-3 ?l-src-2)
            (succ ?l-src-4 ?l-src-3)

            ; correct quantity of liquid of color ?c
            (has-color ?from ?l-src-1 ?c)
            (has-color ?from ?l-src-2 ?c)
            (has-color ?from ?l-src-3 ?c)

            ; lower level of from is bottom or different color
            (or
                (is-bottom ?l-src-4)
                (not (has-color ?from ?l-src-4 ?c))
            )

            ; TO BEAKER STRUCTURE
            ; correct sequence of levels
            (top ?to ?l-dest-0) ; guarantees that there is space on top
            (succ ?l-dest-0 ?l-dest-1)
            (succ ?l-dest-1 ?l-dest-2)
            (succ ?l-dest-2 ?l-dest-3) ; must exist 3 levels after the current top

            ; compability color - destination
            (or
                (is-bottom ?l-dest-0)
                (has-color ?to ?l-dest-0 ?c)
            )
        )
        :effect (and
            ; update se top sequence of from beaker
            (not (top ?from ?l-src-1))
            (top ?from ?l-src-4)

            ; setting new top of to beaker
            (not (top ?to ?l-dest-0))
            (top ?to ?l-dest-3)

            ; removing 3 colors from beaker
            (not (has-color ?from ?l-src-1 ?c))
            (not (has-color ?from ?l-src-2 ?c))
            (not (has-color ?from ?l-src-3 ?c))
            ; adding 3 colors to beaker
            (has-color ?to ?l-dest-1 ?c)
            (has-color ?to ?l-dest-2 ?c)
            (has-color ?to ?l-dest-3 ?c)
        )
    )
    (:action pour-chunk-4
        :parameters (
            ?from - beaker ?to - beaker ?c - color

            ; from beaker levels from top to bottom
            ?l-src-1 - level ; this is the top of color c
            ?l-src-2 - level
            ?l-src-3 - level
            ?l-src-4 - level 
            ?l-src-5 - level ; this is bottom of the beaker and will be the new top

            ; to beaker from top to new top
            ?l-dest-0 - level ; this is the top (l0) and the bottom
            ?l-dest-1 - level
            ?l-dest-2 - level
            ?l-dest-3 - level
            ?l-dest-4 - level ; this will be the new top
        )
        :precondition (and
            (not (= ?from ?to))
            ; FROM BEAKER STRUCTURE
            ; correct sequence of levels
            (top ?from ?l-src-1)
            (succ ?l-src-2 ?l-src-1)
            (succ ?l-src-3 ?l-src-2)
            (succ ?l-src-4 ?l-src-3)
            (succ ?l-src-5 ?l-src-4)

            ; correct quantity of liquid of color ?c
            (has-color ?from ?l-src-1 ?c)
            (has-color ?from ?l-src-2 ?c)
            (has-color ?from ?l-src-3 ?c)
            (has-color ?from ?l-src-4 ?c)

            ; lower level of from has to be the bottom (the bottom has no color)
            (is-bottom ?l-src-5)

            ; TO BEAKER STRUCTURE
            ; correct sequence of levels
            (top ?to ?l-dest-0) ; guarantees that there is space on top
            (succ ?l-dest-0 ?l-dest-1)
            (succ ?l-dest-1 ?l-dest-2)
            (succ ?l-dest-2 ?l-dest-3) 
            (succ ?l-dest-3 ?l-dest-4) ; must exist 4 levels after the current top

            ; compability color - destination
            (is-bottom ?l-dest-0)
        )
        :effect (and
            ; update se top sequence of from beaker
            (not (top ?from ?l-src-1))
            (top ?from ?l-src-5)

            ; setting new top of to beaker
            (not (top ?to ?l-dest-0))
            (top ?to ?l-dest-4)

            ; removing 4 colors from beaker
            (not (has-color ?from ?l-src-1 ?c))
            (not (has-color ?from ?l-src-2 ?c))
            (not (has-color ?from ?l-src-3 ?c))
            (not (has-color ?from ?l-src-4 ?c))
            ; adding 4 colors to beaker
            (has-color ?to ?l-dest-1 ?c)
            (has-color ?to ?l-dest-2 ?c)
            (has-color ?to ?l-dest-3 ?c)
            (has-color ?to ?l-dest-4 ?c)
        )
    )
)

; problem
(define (problem liquidsort_task)
  (:domain LiquidSort)
  (:objects
    b0 b1 b2 b3 b4 b5 b6 - beaker
    c0 c1 c2 c3 c4 - color
    l0 l1 l2 l3 l4 - level
  )

  (:init
    ; --- Geometry of the game (static) ---
    (is-bottom l0)
    (succ l0 l1)
    (succ l1 l2)
    (succ l2 l3)
    (succ l3 l4)

    ; --- Defining initial state of the beakers ---
    (has-color b0 l1 c0)
    (has-color b0 l2 c1)
    (has-color b0 l3 c2)
    (has-color b0 l4 c3)
    (top b0 l4)
    (has-color b1 l1 c1)
    (has-color b1 l2 c0)
    (has-color b1 l3 c4)
    (has-color b1 l4 c1)
    (top b1 l4)
    (has-color b2 l1 c0)
    (has-color b2 l2 c3)
    (has-color b2 l3 c0)
    (has-color b2 l4 c2)
    (top b2 l4)
    (has-color b3 l1 c4)
    (has-color b3 l2 c3)
    (has-color b3 l3 c1)
    (has-color b3 l4 c4)
    (top b3 l4)
    (has-color b4 l1 c2)
    (has-color b4 l2 c4)
    (has-color b4 l3 c3)
    (has-color b4 l4 c2)
    (top b4 l4)
    (top b5 l0)
    (top b6 l0)
  )

  (:goal (and
    ; Goal for color c0
    (or
      (and (has-color b0 l1 c0) (has-color b0 l2 c0) (has-color b0 l3 c0) (has-color b0 l4 c0))
      (and (has-color b1 l1 c0) (has-color b1 l2 c0) (has-color b1 l3 c0) (has-color b1 l4 c0))
      (and (has-color b2 l1 c0) (has-color b2 l2 c0) (has-color b2 l3 c0) (has-color b2 l4 c0))
      (and (has-color b3 l1 c0) (has-color b3 l2 c0) (has-color b3 l3 c0) (has-color b3 l4 c0))
      (and (has-color b4 l1 c0) (has-color b4 l2 c0) (has-color b4 l3 c0) (has-color b4 l4 c0))
      (and (has-color b5 l1 c0) (has-color b5 l2 c0) (has-color b5 l3 c0) (has-color b5 l4 c0))
      (and (has-color b6 l1 c0) (has-color b6 l2 c0) (has-color b6 l3 c0) (has-color b6 l4 c0))
    )
    ; Goal for color c1
    (or
      (and (has-color b0 l1 c1) (has-color b0 l2 c1) (has-color b0 l3 c1) (has-color b0 l4 c1))
      (and (has-color b1 l1 c1) (has-color b1 l2 c1) (has-color b1 l3 c1) (has-color b1 l4 c1))
      (and (has-color b2 l1 c1) (has-color b2 l2 c1) (has-color b2 l3 c1) (has-color b2 l4 c1))
      (and (has-color b3 l1 c1) (has-color b3 l2 c1) (has-color b3 l3 c1) (has-color b3 l4 c1))
      (and (has-color b4 l1 c1) (has-color b4 l2 c1) (has-color b4 l3 c1) (has-color b4 l4 c1))
      (and (has-color b5 l1 c1) (has-color b5 l2 c1) (has-color b5 l3 c1) (has-color b5 l4 c1))
      (and (has-color b6 l1 c1) (has-color b6 l2 c1) (has-color b6 l3 c1) (has-color b6 l4 c1))
    )
    ; Goal for color c2
    (or
      (and (has-color b0 l1 c2) (has-color b0 l2 c2) (has-color b0 l3 c2) (has-color b0 l4 c2))
      (and (has-color b1 l1 c2) (has-color b1 l2 c2) (has-color b1 l3 c2) (has-color b1 l4 c2))
      (and (has-color b2 l1 c2) (has-color b2 l2 c2) (has-color b2 l3 c2) (has-color b2 l4 c2))
      (and (has-color b3 l1 c2) (has-color b3 l2 c2) (has-color b3 l3 c2) (has-color b3 l4 c2))
      (and (has-color b4 l1 c2) (has-color b4 l2 c2) (has-color b4 l3 c2) (has-color b4 l4 c2))
      (and (has-color b5 l1 c2) (has-color b5 l2 c2) (has-color b5 l3 c2) (has-color b5 l4 c2))
      (and (has-color b6 l1 c2) (has-color b6 l2 c2) (has-color b6 l3 c2) (has-color b6 l4 c2))
    )
    ; Goal for color c3
    (or
      (and (has-color b0 l1 c3) (has-color b0 l2 c3) (has-color b0 l3 c3) (has-color b0 l4 c3))
      (and (has-color b1 l1 c3) (has-color b1 l2 c3) (has-color b1 l3 c3) (has-color b1 l4 c3))
      (and (has-color b2 l1 c3) (has-color b2 l2 c3) (has-color b2 l3 c3) (has-color b2 l4 c3))
      (and (has-color b3 l1 c3) (has-color b3 l2 c3) (has-color b3 l3 c3) (has-color b3 l4 c3))
      (and (has-color b4 l1 c3) (has-color b4 l2 c3) (has-color b4 l3 c3) (has-color b4 l4 c3))
      (and (has-color b5 l1 c3) (has-color b5 l2 c3) (has-color b5 l3 c3) (has-color b5 l4 c3))
      (and (has-color b6 l1 c3) (has-color b6 l2 c3) (has-color b6 l3 c3) (has-color b6 l4 c3))
    )
    ; Goal for color c4
    (or
      (and (has-color b0 l1 c4) (has-color b0 l2 c4) (has-color b0 l3 c4) (has-color b0 l4 c4))
      (and (has-color b1 l1 c4) (has-color b1 l2 c4) (has-color b1 l3 c4) (has-color b1 l4 c4))
      (and (has-color b2 l1 c4) (has-color b2 l2 c4) (has-color b2 l3 c4) (has-color b2 l4 c4))
      (and (has-color b3 l1 c4) (has-color b3 l2 c4) (has-color b3 l3 c4) (has-color b3 l4 c4))
      (and (has-color b4 l1 c4) (has-color b4 l2 c4) (has-color b4 l3 c4) (has-color b4 l4 c4))
      (and (has-color b5 l1 c4) (has-color b5 l2 c4) (has-color b5 l3 c4) (has-color b5 l4 c4))
      (and (has-color b6 l1 c4) (has-color b6 l2 c4) (has-color b6 l3 c4) (has-color b6 l4 c4))
    )
  ))
)

; plan
1. (pour-chunk-1 b1 b5 c1 l4 l3 l0 l1)
   deleted: (top b1 l4) (top b5 l0) (has-color b1 l4 c1)
   added: (top b1 l3) (top b5 l1) (has-color b5 l1 c1)
   goals met: 0 of 5
2. (pour-chunk-1 b0 b6 c3 l4 l3 l0 l1)
   deleted: (top b0 l4) (top b6 l0) (has-color b0 l4 c3)
   added: (top b0 l3) (top b6 l1) (has-color b6 l1 c3)
   goals met: 0 of 5
3. (pour-chunk-1 b4 b0 c2 l4 l3 l3 l4)
   deleted: (top b4 l4) (top b0 l3) (has-color b4 l4 c2)
   added: (top b4 l3) (top b0 l4) (has-color b0 l4 c2)
   goals met: 0 of 5
4. (pour-chunk-1 b3 b1 c4 l4 l3 l3 l4)
   deleted: (top b3 l4) (top b1 l3) (has-color b3 l4 c4)
   added: (top b3 l3) (top b1 l4) (has-color b1 l4 c4)
   goals met: 0 of 5
5. (pour-chunk-1 b3 b5 c1 l3 l2 l1 l2)
   deleted: (top b3 l3) (top b5 l1) (has-color b3 l3 c1)
   added: (top b3 l2) (top b5 l2) (has-color b5 l2 c1)
   goals met: 0 of 5
6. (pour-chunk-1 b3 b6 c3 l2 l1 l1 l2)
   deleted: (top b3 l2) (top b6 l1) (has-color b3 l2 c3)
   added: (top b3 l1) (top b6 l2) (has-color b6 l2 c3)
   goals met: 0 of 5
7. (pour-chunk-2 b1 b3 c4 l4 l3 l2 l1 l2 l3)
   deleted: (top b1 l4) (top b3 l1) (has-color b1 l4 c4) (has-color b1 l3 c4)
   added: (top b1 l2) (top b3 l3) (has-color b3 l2 c4) (has-color b3 l3 c4)
   goals met: 0 of 5
8. (pour-chunk-1 b4 b6 c3 l3 l2 l2 l3)
   deleted: (top b4 l3) (top b6 l2) (has-color b4 l3 c3)
   added: (top b4 l2) (top b6 l3) (has-color b6 l3 c3)
   goals met: 0 of 5
9. (pour-chunk-1 b4 b3 c4 l2 l1 l3 l4)
   deleted: (top b4 l2) (top b3 l3) (has-color b4 l2 c4)
   added: (top b4 l1) (top b3 l4) (has-color b3 l4 c4)
   goals met: 1 of 5
10. (pour-chunk-2 b0 b4 c2 l4 l3 l2 l1 l2 l3)
   deleted: (top b0 l4) (top b4 l1) (has-color b0 l4 c2) (has-color b0 l3 c2)
   added: (top b0 l2) (top b4 l3) (has-color b4 l2 c2) (has-color b4 l3 c2)
   goals met: 1 of 5
11. (pour-chunk-1 b2 b4 c2 l4 l3 l3 l4)
   deleted: (top b2 l4) (top b4 l3) (has-color b2 l4 c2)
   added: (top b2 l3) (top b4 l4) (has-color b4 l4 c2)
   goals met: 2 of 5
12. (pour-chunk-1 b1 b2 c0 l2 l1 l3 l4)
   deleted: (top b1 l2) (top b2 l3) (has-color b1 l2 c0)
   added: (top b1 l1) (top b2 l4) (has-color b2 l4 c0)
   goals met: 2 of 5
13. (pour-chunk-1 b0 b1 c1 l2 l1 l1 l2)
   deleted: (top b0 l2) (top b1 l1) (has-color b0 l2 c1)
   added: (top b0 l1) (top b1 l2) (has-color b1 l2 c1)
   goals met: 2 of 5
14. (pour-chunk-2 b2 b0 c0 l4 l3 l2 l1 l2 l3)
   deleted: (top b2 l4) (top b0 l1) (has-color b2 l4 c0) (has-color b2 l3 c0)
   added: (top b2 l2) (top b0 l3) (has-color b0 l2 c0) (has-color b0 l3 c0)
   goals met: 2 of 5
15. (pour-chunk-2 b1 b5 c1 l2 l1 l0 l2 l3 l4)
   deleted: (top b1 l2) (top b5 l2) (has-color b1 l2 c1) (has-color b1 l1 c1)
   added: (top b1 l0) (top b5 l4) (has-color b5 l3 c1) (has-color b5 l4 c1)
   goals met: 3 of 5
16. (pour-chunk-1 b2 b6 c3 l2 l1 l3 l4)
   deleted: (top b2 l2) (top b6 l3) (has-color b2 l2 c3)
   added: (top b2 l1) (top b6 l4) (has-color b6 l4 c3)
   goals met: 4 of 5
17. (pour-chunk-3 b0 b2 c0 l3 l2 l1 l0 l1 l2 l3 l4)
   deleted: (top b0 l3) (top b2 l1) (has-color b0 l3 c0) (has-color b0 l2 c0) (has-color b0 l1 c0)
   added: (top b0 l0) (top b2 l4) (has-color b2 l2 c0) (has-color b2 l3 c0) (has-color b2 l4 c0)
   goals met: 5 of 5
